tap "eth-p/software"
tap "fsouza/prettierd"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "how2terminal/how2"
tap "jesseduffield/horcrux"
tap "mongodb/brew"
tap "sidneys/homebrew"
brew "antibody"
brew "xz"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "python@3.11"
brew "archey4"
brew "libssh2"
brew "aria2"
brew "autojump"
brew "docutils", link: false
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bazelisk"
brew "bib-tool"
brew "black"
brew "bottom"
brew "cabextract"
brew "coreutils"
brew "cask"
brew "cdrtools"
brew "ncurses"
brew "qemu"
brew "lima"
brew "colima"
brew "dnsmasq"
brew "docker"
brew "docker-compose"
brew "doctl"
brew "dos2unix"
brew "dstask"
brew "exa"
brew "exercism"
brew "exiftool"
brew "fd"
brew "feroxbuster"
brew "fzf"
brew "isl"
brew "gcc"
brew "git"
brew "glow"
brew "go"
brew "gobuster"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "gum"
brew "python@3.9"
brew "haskell-stack"
brew "httpie"
brew "hub"
brew "jenv"
brew "k6"
brew "krb5"
brew "perl"
brew "latexindent"
brew "lazygit"
brew "links"
brew "llvm"
brew "lua"
brew "luv"
brew "ruby"
brew "macvim"
brew "node"
brew "mongosh"
brew "mupdf-tools"
brew "neovim"
brew "nmap"
brew "node@16"
brew "onefetch"
brew "openjdk"
brew "openjdk@11"
brew "pandoc"
brew "pdftohtml"
brew "pnpm"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "tcl-tk"
brew "python-tk@3.9"
brew "python@3.8"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "rizin"
brew "smartmontools"
brew "spotify-tui"
brew "spotifyd"
brew "starship"
brew "task"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "typst"
brew "w3m"
brew "watch"
brew "wget"
brew "wimlib"
brew "xclip"
brew "zlib"
brew "zoxide"
brew "fsouza/prettierd/prettierd"
brew "heroku/brew/heroku"
brew "how2terminal/how2/how2"
brew "jesseduffield/horcrux/horcrux"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-community@4.4"
brew "sidneys/homebrew/chntpw"
cask "background-music"
cask "db-browser-for-sqlite"
cask "dotnet-sdk"
cask "fig"
cask "font-fira-code"
cask "font-iosevka"
cask "powershell"
cask "sioyek"
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "dineug.vuerd-vscode"
vscode "donjayamanne.javadebugger"
vscode "draivin.hscopes"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fehey.brackets-light-pro"
vscode "foxundermoon.shell-format"
vscode "geoffkaile.latex-count"
vscode "georgewfraser.vscode-javac"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "haskell.haskell"
vscode "James-Yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "justusadam.language-haskell"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "rogalmic.bash-debug"
vscode "RReverser.llvm"
vscode "syler.sass-indented"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "XadillaX.viml"
vscode "yinfei.luahelper"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
